Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aks_module.azurerm_kubernetes_cluster.k8s will be created
  + resource "azurerm_kubernetes_cluster" "k8s" {
      + dns_prefix              = "coupa-k8s-01"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + kube_admin_config       = (known after apply)
      + kube_admin_config_raw   = (sensitive value)
      + kube_config             = (known after apply)
      + kube_config_raw         = (sensitive value)
      + kubelet_identity        = (known after apply)
      + kubernetes_version      = (known after apply)
      + location                = "uksouth"
      + name                    = "dev-AKS-CLUSTER"
      + node_resource_group     = (known after apply)
      + private_cluster_enabled = (known after apply)
      + private_fqdn            = (known after apply)
      + private_link_enabled    = (known after apply)
      + resource_group_name     = "dev-AZ-MICROSERVICES-RG"
      + sku_tier                = "Free"
      + tags                    = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }

      + addon_profile {

          + kube_dashboard {
              + enabled = true
            }
        }

      + auto_scaler_profile {
          + balance_similar_node_groups      = (known after apply)
          + max_graceful_termination_sec     = (known after apply)
          + new_pod_scale_up_delay           = (known after apply)
          + scale_down_delay_after_add       = (known after apply)
          + scale_down_delay_after_delete    = (known after apply)
          + scale_down_delay_after_failure   = (known after apply)
          + scale_down_unneeded              = (known after apply)
          + scale_down_unready               = (known after apply)
          + scale_down_utilization_threshold = (known after apply)
          + scan_interval                    = (known after apply)
        }

      + default_node_pool {
          + max_pods             = (known after apply)
          + name                 = "default"
          + node_count           = 1
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = 30
          + os_disk_type         = "Managed"
          + type                 = "VirtualMachineScaleSets"
          + vm_size              = "Standard_B2s"
          + vnet_subnet_id       = (known after apply)
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "standard"
          + network_mode       = (known after apply)
          + network_plugin     = "kubenet"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + idle_timeout_in_minutes   = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
              + outbound_ports_allocated  = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = true
        }

      + service_principal {
          + client_id     = (known after apply)
          + client_secret = (sensitive value)
        }

      + windows_profile {
          + admin_password = (sensitive value)
          + admin_username = (known after apply)
        }
    }

  # module.network_module.azurerm_subnet.aks_subnet1 will be created
  + resource "azurerm_subnet" "aks_subnet1" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.252.9.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "node_subnet"
      + resource_group_name                            = "dev-AZ-MICROSERVICES-RG"
      + virtual_network_name                           = "dev-aks-vnet-02"
    }

  # module.network_module.azurerm_subnet.app_subnet will be created
  + resource "azurerm_subnet" "app_subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.252.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "app_subnet"
      + resource_group_name                            = "dev-AZ-SRV-RG"
      + virtual_network_name                           = "dev-srv-vnet-01"
    }

  # module.network_module.azurerm_subnet.application_gateway_subnet will be created
  + resource "azurerm_subnet" "application_gateway_subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.252.5.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "application_gateway_subnet"
      + resource_group_name                            = "dev-AZ-SRV-RG"
      + virtual_network_name                           = "dev-srv-vnet-01"
    }

  # module.network_module.azurerm_subnet.backend_subnet will be created
  + resource "azurerm_subnet" "backend_subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.252.3.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "backend_subnet"
      + resource_group_name                            = "dev-AZ-SRV-RG"
      + virtual_network_name                           = "dev-srv-vnet-01"
    }

  # module.network_module.azurerm_subnet.frontend_subnet will be created
  + resource "azurerm_subnet" "frontend_subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.252.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "frontend_subnet"
      + resource_group_name                            = "dev-AZ-SRV-RG"
      + virtual_network_name                           = "dev-srv-vnet-01"
    }

  # module.network_module.azurerm_subnet.web_subnet will be created
  + resource "azurerm_subnet" "web_subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.252.4.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "web_subnet"
      + resource_group_name                            = "dev-AZ-SRV-RG"
      + virtual_network_name                           = "dev-srv-vnet-01"
    }

  # module.network_module.azurerm_subnet_network_security_group_association.nsga1 will be created
  + resource "azurerm_subnet_network_security_group_association" "nsga1" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.network_module.azurerm_subnet_network_security_group_association.nsga2 will be created
  + resource "azurerm_subnet_network_security_group_association" "nsga2" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.network_module.azurerm_subnet_network_security_group_association.nsga3 will be created
  + resource "azurerm_subnet_network_security_group_association" "nsga3" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.network_module.azurerm_subnet_network_security_group_association.nsga4 will be created
  + resource "azurerm_subnet_network_security_group_association" "nsga4" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.network_module.azurerm_subnet_network_security_group_association.nsga5 will be created
  + resource "azurerm_subnet_network_security_group_association" "nsga5" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.network_module.azurerm_virtual_network.aks_vnet1 will be created
  + resource "azurerm_virtual_network" "aks_vnet1" {
      + address_space         = [
          + "10.252.8.0/21",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "uksouth"
      + name                  = "dev-aks-vnet-02"
      + resource_group_name   = "dev-AZ-MICROSERVICES-RG"
      + subnet                = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }
      + vm_protection_enabled = false
    }

  # module.network_module.azurerm_virtual_network.vm_vnet1 will be created
  + resource "azurerm_virtual_network" "vm_vnet1" {
      + address_space         = [
          + "10.252.0.0/21",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "uksouth"
      + name                  = "dev-srv-vnet-01"
      + resource_group_name   = "dev-AZ-SRV-RG"
      + subnet                = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }
      + vm_protection_enabled = false
    }

  # module.network_module.azurerm_virtual_network_peering.peer-1 will be created
  + resource "azurerm_virtual_network_peering" "peer-1" {
      + allow_forwarded_traffic      = (known after apply)
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "llamasoft_vnet_to_aks_vnet"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "dev-AZ-SRV-RG"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "dev-srv-vnet-01"
    }

  # module.network_module.azurerm_virtual_network_peering.peer-2 will be created
  + resource "azurerm_virtual_network_peering" "peer-2" {
      + allow_forwarded_traffic      = (known after apply)
      + allow_gateway_transit        = (known after apply)
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "aks_vnet_to_llamasoft_vnet"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "dev-AZ-MICROSERVICES-RG"
      + use_remote_gateways          = (known after apply)
      + virtual_network_name         = "dev-aks-vnet-02"
    }

  # module.network_security_group_module.azurerm_network_security_group.nsg1 will be created
  + resource "azurerm_network_security_group" "nsg1" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "dev-app_subnet_nsg"
      + resource_group_name = "dev-AZ-SRV-RG"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }
    }

  # module.network_security_group_module.azurerm_network_security_group.nsg2 will be created
  + resource "azurerm_network_security_group" "nsg2" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "dev-frontend_subnet_nsg"
      + resource_group_name = "dev-AZ-SRV-RG"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }
    }

  # module.network_security_group_module.azurerm_network_security_group.nsg3 will be created
  + resource "azurerm_network_security_group" "nsg3" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "dev-backend_subnet_nsg"
      + resource_group_name = "dev-AZ-SRV-RG"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }
    }

  # module.network_security_group_module.azurerm_network_security_group.nsg4 will be created
  + resource "azurerm_network_security_group" "nsg4" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "dev-web_subnet_nsg"
      + resource_group_name = "dev-AZ-SRV-RG"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }
    }

  # module.network_security_group_module.azurerm_network_security_group.nsg5 will be created
  + resource "azurerm_network_security_group" "nsg5" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "dev-appgw_subnet_nsg"
      + resource_group_name = "dev-AZ-SRV-RG"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg1_icmp will be created
  + resource "azurerm_network_security_rule" "nsg1_icmp" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "ICMP"
      + network_security_group_name = "dev-app_subnet_nsg"
      + priority                    = 3000
      + protocol                    = "Icmp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg1_security_rules["101"] will be created
  + resource "azurerm_network_security_rule" "nsg1_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_22"
      + network_security_group_name = "dev-app_subnet_nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg1_security_rules["102"] will be created
  + resource "azurerm_network_security_rule" "nsg1_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_3389"
      + network_security_group_name = "dev-app_subnet_nsg"
      + priority                    = 102
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg2_icmp will be created
  + resource "azurerm_network_security_rule" "nsg2_icmp" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "ICMP"
      + network_security_group_name = "dev-frontend_subnet_nsg"
      + priority                    = 3000
      + protocol                    = "Icmp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg2_security_rules["101"] will be created
  + resource "azurerm_network_security_rule" "nsg2_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_22"
      + network_security_group_name = "dev-frontend_subnet_nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg2_security_rules["102"] will be created
  + resource "azurerm_network_security_rule" "nsg2_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_3389"
      + network_security_group_name = "dev-frontend_subnet_nsg"
      + priority                    = 102
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg3_icmp will be created
  + resource "azurerm_network_security_rule" "nsg3_icmp" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "ICMP"
      + network_security_group_name = "dev-backend_subnet_nsg"
      + priority                    = 3000
      + protocol                    = "Icmp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg3_security_rules["101"] will be created
  + resource "azurerm_network_security_rule" "nsg3_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_22"
      + network_security_group_name = "dev-backend_subnet_nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg3_security_rules["102"] will be created
  + resource "azurerm_network_security_rule" "nsg3_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_3389"
      + network_security_group_name = "dev-backend_subnet_nsg"
      + priority                    = 102
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg4_icmp will be created
  + resource "azurerm_network_security_rule" "nsg4_icmp" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "ICMP"
      + network_security_group_name = "dev-web_subnet_nsg"
      + priority                    = 3000
      + protocol                    = "Icmp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg4_security_rules["101"] will be created
  + resource "azurerm_network_security_rule" "nsg4_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_22"
      + network_security_group_name = "dev-web_subnet_nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-COUPA_SERVER_RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg4_security_rules["102"] will be created
  + resource "azurerm_network_security_rule" "nsg4_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_3389"
      + network_security_group_name = "dev-web_subnet_nsg"
      + priority                    = 102
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-COUPA_SERVER_RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg5_icmp will be created
  + resource "azurerm_network_security_rule" "nsg5_icmp" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "ICMP"
      + network_security_group_name = "dev-appgw_subnet_nsg"
      + priority                    = 3000
      + protocol                    = "Icmp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg5_security_rules["101"] will be created
  + resource "azurerm_network_security_rule" "nsg5_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "22"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_22"
      + network_security_group_name = "dev-appgw_subnet_nsg"
      + priority                    = 101
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg5_security_rules["102"] will be created
  + resource "azurerm_network_security_rule" "nsg5_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3389"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_3389"
      + network_security_group_name = "dev-appgw_subnet_nsg"
      + priority                    = 102
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network_security_group_module.azurerm_network_security_rule.nsg5_security_rules["103"] will be created
  + resource "azurerm_network_security_rule" "nsg5_security_rules" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "65200-65535"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "port_65200-65535"
      + network_security_group_name = "dev-appgw_subnet_nsg"
      + priority                    = 103
      + protocol                    = "Tcp"
      + resource_group_name         = "dev-AZ-SRV-RG"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.resource_group_module.azurerm_resource_group.rg1 will be created
  + resource "azurerm_resource_group" "rg1" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dev-AZ-SRV-RG"
      + tags     = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }
    }

  # module.resource_group_module.azurerm_resource_group.rg2 will be created
  + resource "azurerm_resource_group" "rg2" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "dev-AZ-MICROSERVICES-RG"
      + tags     = {
          + "Environment" = "dev"
          + "Owner"       = "coupa-dev-team"
        }
    }

  # module.service_principal_module.azuread_application.app01 will be created
  + resource "azuread_application" "app01" {
      + app_role                = (known after apply)
      + application_id          = (known after apply)
      + display_name            = (known after apply)
      + homepage                = (known after apply)
      + id                      = (known after apply)
      + identifier_uris         = (known after apply)
      + name                    = "dev-k8s-app"
      + oauth2_permissions      = (known after apply)
      + object_id               = (known after apply)
      + owners                  = (known after apply)
      + prevent_duplicate_names = false
      + public_client           = (known after apply)
      + reply_urls              = (known after apply)
      + type                    = "webapp/api"
    }

  # module.service_principal_module.azuread_service_principal.sp01 will be created
  + resource "azuread_service_principal" "sp01" {
      + app_roles      = (known after apply)
      + application_id = (known after apply)
      + display_name   = (known after apply)
      + id             = (known after apply)
      + object_id      = (known after apply)

      + oauth2_permissions {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + id                         = (known after apply)
          + is_enabled                 = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }
    }

  # module.service_principal_module.azuread_service_principal_password.sp_pass01 will be created
  + resource "azuread_service_principal_password" "sp_pass01" {
      + description          = "My managed password"
      + end_date             = "2022-01-01T01:02:03Z"
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # module.service_principal_module.random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 24
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = true
      + upper       = true
    }

Plan: 43 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis01-7c844d86c6-8l8pt:4141/lock?id=ajinkya-bhabal-ifi%252Fllama-aks-vnet1%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
